// Auto-generated structure for Starfinder
// Generated: 2025-11-26T08:30:11.357Z

const structure = {
  "Бестиарий": {
    "type": "card-list",
    "items": {
      "Анацит": "sources/Бестиарий/Анацит.md",
      "Ангел, барахий": "sources/Бестиарий/Ангел, Барахий.md",
      "Апари": "sources/Бестиарий/Апари.md",
      "Астерай": "sources/Бестиарий/Астерай.md",
      "Барату": "sources/Бестиарий/Барату.md",
      "Бестиарий": "sources/Бестиарий/Бестиарий.md",
      "Бриварт": "sources/Бестиарий/Бриварт.md",
      "Вертани": "sources/Бестиарий/Вертани.md",
      "Вечная гвардия": "sources/Бестиарий/Вечная гвардия.md",
      "Вичвирд": "sources/Бестиарий/Вичвирд.md",
      "Геспер": "sources/Бестиарий/Геспер.md",
      "Горный угорь": "sources/Бестиарий/Горный угорь.md",
      "Де Ноло": "sources/Бестиарий/Де-Ноло.md",
      "Дракон": "sources/Бестиарий/Дракон.md",
      "Драконоид": "sources/Бестиарий/Драконоид.md",
      "Дроу": "sources/Бестиарий/Дроу.md",
      "Дрэлик": "sources/Бестиарий/Дрэлик.md",
      "Дьявол, вестник погибели": "sources/Бестиарий/Дьявол, Вестник Погибели.md",
      "Икешти": "sources/Бестиарий/Икешти.md",
      "Кало": "sources/Бестиарий/Кало.md",
      "Кейпин": "sources/Бестиарий/Кейпин.md",
      "Космогоблин": "sources/Бестиарий/Космогоблин.md",
      "Костоед": "sources/Бестиарий/Костоед.md",
      "Кровник": "sources/Бестиарий/Кровник.md",
      "Ксарик": "sources/Бестиарий/Ксарик.md",
      "Кьёкор": "sources/Бестиарий/Кьёкор.md",
      "Личинка сверхновой": "sources/Бестиарий/Личинка Сверхновой.md",
      "Маракой": "sources/Бестиарий/Маракой.md",
      "Некровит": "sources/Бестиарий/Некровит.md",
      "Неотвратимый, анхамут": "sources/Бестиарий/Неотвратимый, Анхамут.md",
      "Неразумная нежить": "sources/Бестиарий/Неразумная Нежить.md",
      "Нюар": "sources/Бестиарий/Нюар.md",
      "Ома": "sources/Бестиарий/Ома.md",
      "Орокоран": "sources/Бестиарий/Орокоран.md",
      "Острокрыл": "sources/Бестиарий/Острокрыл.md",
      "Пустотная карга": "sources/Бестиарий/Пустотная Карга.md",
      "Рептоид": "sources/Бестиарий/Рептоид.md",
      "Рикричи": "sources/Бестиарий/Рикричи.md",
      "Рифорианин": "sources/Бестиарий/Рифорианин.md",
      "Робот": "sources/Бестиарий/Робот.md",
      "Рой": "sources/Бестиарий/Рой.md",
      "Саркезианин": "sources/Бестиарий/Саркезианин.md",
      "Сборочная жижа": "sources/Бестиарий/Сборочная Жижа.md",
      "Серый пришелец": "sources/Бестиарий/Серый Пришелец.md",
      "Симбирид": "sources/Бестиарий/Симбирид.md",
      "Скиттермандер": "sources/Бестиарий/Скиттермандер.md",
      "Слизь Мародёр": "sources/Бестиарий/Слизь-Мародёр.md",
      "Созерцатель": "sources/Бестиарий/Созерцатель.md",
      "Сурнох": "sources/Бестиарий/Сурнох.md",
      "Урог": "sources/Бестиарий/Урог.md",
      "Формианин": "sources/Бестиарий/Формианин.md",
      "Фружай": "sources/Бестиарий/Фружай.md",
      "Хаан": "sources/Бестиарий/Хаан.md",
      "Халладжин": "sources/Бестиарий/Халладжин.md",
      "Шовад": "sources/Бестиарий/Шовад.md",
      "Штар": "sources/Бестиарий/Штар.md",
      "Электрофаг": "sources/Бестиарий/Электрофаг.md",
      "Элементаль": "sources/Бестиарий/Элементаль.md",
      "Элликот": "sources/Бестиарий/Элликот.md"
    }
  },
  "Ведение игры": {
    "type": "card-list",
    "items": {
      "Блоки параметров": "sources/Ведение игры/Блоки параметров.md",
      "Ведение игры": "sources/Ведение игры/Ведение игры.md",
      "Ловушки": "sources/Ведение игры/Ловушки.md",
      "Недуги": "sources/Ведение игры/Недуги.md",
      "Окружающая среда": "sources/Ведение игры/Окружающая среда.md",
      "Приключения и кампании": "sources/Ведение игры/Приключения и кампании.md"
    }
  },
  "Дроны": "sources/Дроны.md",
  "Заклинания": {
    "type": "card-list",
    "items": {
      "0 круг": {
        "type": "card-list",
        "items": {
          "Загробные слова": "sources/Заклинания/0 Круг/Загробные слова.md"
        }
      },
      "1 круг": {
        "type": "card-list",
        "items": {
          "Волшебная стрела": "sources/Заклинания/1 Круг/Волшебная стрела.md"
        }
      },
      "2 круг": {
        "type": "card-list",
        "items": {
          "Атака микроботов": "sources/Заклинания/2 Круг/Атака микроботов.md",
          "Взрыв силы": "sources/Заклинания/2 Круг/Взрыв силы.md",
          "Внедрение данных": "sources/Заклинания/2 Круг/Внедрение данных.md"
        }
      },
      "3 круг": {
        "type": "card-list",
        "items": {
          "Власть над машинами": "sources/Заклинания/3 Круг/Власть над машинами.md",
          "Внушение": "sources/Заклинания/3 Круг/Внушение.md",
          "Волшебное зрение": "sources/Заклинания/3 Круг/Волшебное зрение.md"
        }
      },
      "4 круг": {
        "type": "card-list",
        "items": {
          "Возвращение": "sources/Заклинания/4 Круг/Возвращение.md"
        }
      },
      "5 круг": {
        "type": "card-list",
        "items": {
          "Быстрый ремонт": "sources/Заклинания/5 Круг/Быстрый ремонт.md",
          "Возвращение к жизни": "sources/Заклинания/5 Круг/Возвращение к жизни.md",
          "Волна усталости": "sources/Заклинания/5 Круг/Волна усталости.md"
        }
      },
      "6 круг": {
        "type": "card-list",
        "items": {
          "Боевой хламобот": "sources/Заклинания/6 Круг/Боевой хламобот.md",
          "Видение": "sources/Заклинания/6 Круг/Видение.md",
          "Власть над гравитацией": "sources/Заклинания/6 Круг/Власть над гравитацией.md",
          "Власть над нежитью": "sources/Заклинания/6 Круг/Власть над нежитью.md",
          "Внушение, массовое": "sources/Заклинания/6 Круг/Внушение, массовое.md"
        }
      },
      "Заклинания мистика": {
        "type": "card-list",
        "items": {
          "Заклинания мистика": "sources/Заклинания/Заклинания Мистика/Заклинания Мистика.md"
        }
      },
      "Заклинания техноманта": {
        "type": "card-list",
        "items": {
          "Заклинания техноманта": "sources/Заклинания/Заклинания Техноманта/Заклинания Техноманта.md"
        }
      },
      "Магия": "sources/Заклинания/Магия.md",
      "Описание заклинаний": "sources/Заклинания/Описание заклинаний.md"
    }
  },
  "Звездолёты": {
    "type": "card-list",
    "items": {
      "Звездолёты": "sources/Звездолёты/Звездолёты.md",
      "Космические путешествия": "sources/Звездолёты/Космические путешествия.md",
      "Космический бой": "sources/Звездолёты/Космический бой.md",
      "Примеры звездолётов": "sources/Звездолёты/Примеры звездолётов.md",
      "Создание звездолётов": "sources/Звездолёты/Создание звездолётов.md"
    }
  },
  "Классы": {
    "type": "card-list",
    "items": {
      "Вангард": "sources/Классы/Вангард.md",
      "Механик": "sources/Классы/Механик.md",
      "Мистик": "sources/Классы/Мистик.md",
      "Оперативник": "sources/Классы/Оперативник.md",
      "Посланник": "sources/Классы/Посланник.md",
      "Солдат": "sources/Классы/Солдат.md",
      "Солярион": "sources/Классы/Солярион.md",
      "Техномант": "sources/Классы/Техномант.md"
    }
  },
  "Миры игры": {
    "type": "card-list",
    "items": {
      "Великое запределье": {
        "type": "card-list",
        "items": {
          "Астральный план": "sources/Миры игры/Великое запределье/Астральный план.md",
          "Великое запределье": "sources/Миры игры/Великое запределье/Великое Запределье.md",
          "Внешние планы": "sources/Миры игры/Великое запределье/Внешние планы.md",
          "Внутренняя сфера": {
            "type": "card-list",
            "items": {
              "Внутренняя сфера": "sources/Миры игры/Великое запределье/Внутренняя сфера/Внутренняя сфера.md"
            }
          }
        }
      },
      "Вера и религия": {
        "type": "card-list",
        "items": {
          "Абадар": "sources/Миры игры/Вера и религия/Абадар.md",
          "Бесмара": "sources/Миры игры/Вера и религия/Бесмара.md",
          "Вейдан": "sources/Миры игры/Вера и религия/Вейдан.md",
          "Вера и религия": "sources/Миры игры/Вера и религия/Вера и религия.md",
          "Даморитош": "sources/Миры игры/Вера и религия/Даморитош.md",
          "Дезна": "sources/Миры игры/Вера и религия/Дезна.md",
          "Другие бои": {
            "type": "card-list",
            "items": {
              "Другие боги": "sources/Миры игры/Вера и религия/Другие Бои/Другие боги.md"
            }
          },
          "Зон Кутон": "sources/Миры игры/Вера и религия/Зон-Кутон.md",
          "Ибра": "sources/Миры игры/Вера и религия/Ибра.md",
          "Иомедэй": "sources/Миры игры/Вера и религия/Иомедэй.md",
          "Лао шу по": "sources/Миры игры/Вера и религия/Лао Шу По.md",
          "Ньярлатхотеп": "sources/Миры игры/Вера и религия/Ньярлатхотеп.md",
          "Орас": "sources/Миры игры/Вера и религия/Орас.md",
          "Пожиратель": "sources/Миры игры/Вера и религия/Пожиратель.md",
          "Саренрэй": "sources/Миры игры/Вера и религия/Саренрэй.md",
          "Талавет": "sources/Миры игры/Вера и религия/Талавет.md",
          "Триединый": "sources/Миры игры/Вера и религия/Триединый.md",
          "Ургатоа": "sources/Миры игры/Вера и религия/Ургатоа.md",
          "Фаразма": "sources/Миры игры/Вера и религия/Фаразма.md",
          "Хайлакс": "sources/Миры игры/Вера и религия/Хайлакс.md",
          "Элориту": "sources/Миры игры/Вера и религия/Элориту.md",
          "Яраиса": "sources/Миры игры/Вера и религия/Яраиса.md"
        }
      },
      "За пределами миров соглашения": {
        "type": "card-list",
        "items": {
          "Аркванд": "sources/Миры игры/За пределами Миров Соглашения/Аркванд.md",
          "Вексариум": "sources/Миры игры/За пределами Миров Соглашения/Вексариум.md",
          "Джедарат": "sources/Миры игры/За пределами Миров Соглашения/Джедарат.md",
          "Дырявый саван": "sources/Миры игры/За пределами Миров Соглашения/Дырявый Саван.md",
          "Дэгокс 4": "sources/Миры игры/За пределами Миров Соглашения/Дэгокс 4.md",
          "Дэймалко": "sources/Миры игры/За пределами Миров Соглашения/Дэймалко.md",
          "Железная звезда": "sources/Миры игры/За пределами Миров Соглашения/Железная Звезда.md",
          "За пределами миров соглашения": "sources/Миры игры/За пределами Миров Соглашения/За пределами миров Соглашения.md",
          "Звёздная империя ацланти": "sources/Миры игры/За пределами Миров Соглашения/Звёздная Империя Ацланти.md",
          "Касат": "sources/Миры игры/За пределами Миров Соглашения/Касат.md",
          "Кластер табори": "sources/Миры игры/За пределами Миров Соглашения/Кластер Табори.md",
          "Ксио": "sources/Миры игры/За пределами Миров Соглашения/Ксио.md",
          "Лосилл": "sources/Миры игры/За пределами Миров Соглашения/Лосилл.md",
          "Лотун": "sources/Миры игры/За пределами Миров Соглашения/Лотун.md",
          "Ориколай": "sources/Миры игры/За пределами Миров Соглашения/Ориколай.md",
          "Орри": "sources/Миры игры/За пределами Миров Соглашения/Орри.md",
          "Полярная звезда": "sources/Миры игры/За пределами Миров Соглашения/Полярная звезда.md",
          "Прелюрия": "sources/Миры игры/За пределами Миров Соглашения/Прелюрия.md",
          "Трау секо": "sources/Миры игры/За пределами Миров Соглашения/Трау Секо.md",
          "Шадари": "sources/Миры игры/За пределами Миров Соглашения/Шадари.md",
          "Эмброй": "sources/Миры игры/За пределами Миров Соглашения/Эмброй.md"
        }
      },
      "Миры игры": "sources/Миры игры/Миры игры.md",
      "Миры соглашения": {
        "type": "card-list",
        "items": {
          "Абаллон": "sources/Миры игры/Миры Соглашения/Абаллон.md",
          "Актион": "sources/Миры игры/Миры Соглашения/Актион.md",
          "Апостэ": "sources/Миры игры/Миры Соглашения/Апостэ.md",
          "Бреседа": "sources/Миры игры/Миры Соглашения/Бреседа.md",
          "Верчес": "sources/Миры игры/Миры Соглашения/Верчес.md",
          "Диаспора": "sources/Миры игры/Миры Соглашения/Диаспора.md",
          "Идари": "sources/Миры игры/Миры Соглашения/Идари.md",
          "Кастровель": "sources/Миры игры/Миры Соглашения/Кастровель.md",
          "Лиавра": "sources/Миры игры/Миры Соглашения/Лиавра.md",
          "Миры соглашения": "sources/Миры игры/Миры Соглашения/Миры Соглашения.md",
          "Октурон": "sources/Миры игры/Миры Соглашения/Октурон.md",
          "Солнце": "sources/Миры игры/Миры Соглашения/Солнце.md",
          "Станция авессалом": "sources/Миры игры/Миры Соглашения/Станция Авессалом.md",
          "Триакс": "sources/Миры игры/Миры Соглашения/Триакс.md",
          "Эокс": "sources/Миры игры/Миры Соглашения/Эокс.md"
        }
      },
      "Угрозы": {
        "type": "card-list",
        "items": {
          "Звёздная империя ацланти": "sources/Миры игры/Угрозы/Звёздная Империя Ацланти.md",
          "Консорциум аспидов": "sources/Миры игры/Угрозы/Консорциум Аспидов.md",
          "Незримые": "sources/Миры игры/Угрозы/Незримые.md",
          "Рой": "sources/Миры игры/Угрозы/Рой.md",
          "Служители пожирателя": "sources/Миры игры/Угрозы/Служители Пожирателя.md",
          "Угрозы": "sources/Миры игры/Угрозы/Угрозы.md",
          "Чёрный доминион": "sources/Миры игры/Угрозы/Чёрный Доминион.md"
        }
      },
      "Фракции и организации": {
        "type": "card-list",
        "items": {
          "Аугментированные": "sources/Миры игры/Фракции и организации/Аугментированные.md",
          "Блюстители": "sources/Миры игры/Фракции и организации/Блюстители.md",
          "Вольные капитаны": "sources/Миры игры/Фракции и организации/Вольные капитаны.md",
          "Корпорация абадар": "sources/Миры игры/Фракции и организации/Корпорация Абадар.md",
          "Ксеностражи": "sources/Миры игры/Фракции и организации/Ксеностражи.md",
          "Общество звёздных искателей": "sources/Миры игры/Фракции и организации/Общество Звёздных Искателей.md",
          "Прочие организации": "sources/Миры игры/Фракции и организации/Прочие организации.md",
          "Рыцари голариона": "sources/Миры игры/Фракции и организации/Рыцари Голариона.md",
          "Рыцыри преисподней": "sources/Миры игры/Фракции и организации/Рыцыри Преисподней.md",
          "Фракции и организации": "sources/Миры игры/Фракции и организации/Фракции и организации.md",
          "Фронт освобождения андроидов": "sources/Миры игры/Фракции и организации/Фронт Освобождения Андроидов.md"
        }
      },
      "Хронология событий в мирах соглашения": "sources/Миры игры/Хронология событий в Мирах соглашения.md"
    }
  },
  "Навыки": {
    "type": "card-list",
    "items": "sources/Навыки.md"
  },
  "Наследие pathfinder": {
    "type": "card-list",
    "items": {
      "Наследие pathfinder": "sources/Наследие Pathfinder/Наследие Pathfinder.md",
      "Правила переноса": "sources/Наследие Pathfinder/Правила переноса.md"
    }
  },
  "Расы": {
    "type": "card-list",
    "items": {
      "Расы alien archive": {
        "type": "card-list",
        "items": {
          "Барату": "sources/Расы/Расы Alien Archive/Барату.md",
          "Вертани": "sources/Расы/Расы Alien Archive/Вертани.md",
          "Вичвирд": "sources/Расы/Расы Alien Archive/Вичвирд.md",
          "Драконоид": "sources/Расы/Расы Alien Archive/Драконоид.md",
          "Дроу": "sources/Расы/Расы Alien Archive/Дроу.md",
          "Дрэлик": "sources/Расы/Расы Alien Archive/Дрэлик.md",
          "Икешти": "sources/Расы/Расы Alien Archive/Икешти.md",
          "Кало": "sources/Расы/Расы Alien Archive/Кало.md",
          "Космогоблин": "sources/Расы/Расы Alien Archive/Космогоблин.md",
          "Маракой": "sources/Расы/Расы Alien Archive/Маракой.md",
          "Нюар": "sources/Расы/Расы Alien Archive/Нюар.md",
          "Рептилоид": "sources/Расы/Расы Alien Archive/Рептилоид.md",
          "Рикричи": "sources/Расы/Расы Alien Archive/Рикричи.md",
          "Рифорианин": "sources/Расы/Расы Alien Archive/Рифорианин.md",
          "Саркезианин": "sources/Расы/Расы Alien Archive/Саркезианин.md",
          "Серый пришелец": "sources/Расы/Расы Alien Archive/Серый Пришелец.md",
          "Урог": "sources/Расы/Расы Alien Archive/Урог.md",
          "Шовад": "sources/Расы/Расы Alien Archive/Шовад.md"
        }
      },
      "Расы crb": {
        "type": "card-list",
        "items": {
          "Андроиды": "sources/Расы/Расы CRB/Андроиды.md",
          "Вески": "sources/Расы/Расы CRB/Вески.md",
          "Гномы": "sources/Расы/Расы CRB/Гномы.md",
          "Дварфы": "sources/Расы/Расы CRB/Дварфы.md",
          "Исоки": "sources/Расы/Расы CRB/Исоки.md",
          "Касаты": "sources/Расы/Расы CRB/Касаты.md",
          "Лашунты": "sources/Расы/Расы CRB/Лашунты.md",
          "Люди": "sources/Расы/Расы CRB/Люди.md",
          "Полуорки": "sources/Расы/Расы CRB/Полуорки.md",
          "Полурослики": "sources/Расы/Расы CRB/Полурослики.md",
          "Полуэльфы": "sources/Расы/Расы CRB/Полуэльфы.md",
          "Ширрены": "sources/Расы/Расы CRB/Ширрены.md",
          "Эльфы": "sources/Расы/Расы CRB/Эльфы.md"
        }
      },
      "Расы enhanced": {
        "type": "card-list",
        "items": {
          "Кицунэ": "sources/Расы/Расы Enhanced/Кицунэ.md"
        }
      }
    }
  },
  "Снаряжение": {
    "type": "card-list",
    "items": {
      "Аугментации": "sources/Снаряжение/Аугментации.md",
      "Броня": "sources/Снаряжение/Броня.md",
      "Гибридные предметы": "sources/Снаряжение/Гибридные предметы.md",
      "Компьютеры": "sources/Снаряжение/Компьютеры.md",
      "Магические предметы": "sources/Снаряжение/Магические предметы.md",
      "Оружие": "sources/Снаряжение/Оружие.md",
      "Прочее снаряжение": "sources/Снаряжение/Прочее снаряжение.md",
      "Снаряжение": "sources/Снаряжение/Снаряжение.md",
      "Технологические предметы": "sources/Снаряжение/Технологические предметы.md",
      "Транспортные средства": "sources/Снаряжение/Транспортные средства.md"
    }
  },
  "Создание  персонажей": {
    "type": "card-list",
    "items": {
      "Здоровье и решимость": "sources/Создание  персонажей/Здоровье и решимость.md",
      "Значения характеристик": "sources/Создание  персонажей/Значения характеристик.md",
      "Мировозрение": "sources/Создание  персонажей/Мировозрение.md",
      "Повышение в уровне": "sources/Создание  персонажей/Повышение в уровне.md",
      "Этапы создания персонажей": "sources/Создание  персонажей/Этапы создания персонажей.md"
    }
  },
  "Тактические правила": {
    "type": "card-list",
    "items": {
      "Боевые модификаторы": "sources/Тактические правила/Боевые модификаторы.md",
      "Бонусы и штрафы": "sources/Тактические правила/Бонусы и штрафы.md",
      "Восприятие": "sources/Тактические правила/Восприятие.md",
      "Действия в бою": "sources/Тактические правила/Действия в бою.md",
      "Определение эффектов": "sources/Тактические правила/Определение эффектов.md",
      "Основные понятия боевой системы": "sources/Тактические правила/Основные понятия боевой системы.md",
      "Особые способности": "sources/Тактические правила/Особые способности.md",
      "Ранения и смерть": "sources/Тактические правила/Ранения и смерть.md",
      "Состояния": "sources/Тактические правила/Состояния.md",
      "Тактические перемещения и позиционирование": "sources/Тактические правила/Тактические перемещения и позиционирование.md",
      "Тактические правила для транспортных средств": "sources/Тактические правила/Тактические правила для транспортных средств.md",
      "Транспортные погони": "sources/Тактические правила/Транспортные погони.md"
    }
  },
  "Темы": {
    "type": "card-list",
    "items": {
      "Ас": "sources/Темы/Ас.md",
      "Без темы": "sources/Темы/Без темы.md",
      "Ксеноискатель": "sources/Темы/Ксеноискатель.md",
      "Кумир": "sources/Темы/Кумир.md",
      "Наёмник": "sources/Темы/Наёмник.md",
      "Охотник за головами": "sources/Темы/Охотник за головами.md",
      "Покоритель космоса": "sources/Темы/Покоритель космоса.md",
      "Преступник": "sources/Темы/Преступник.md",
      "Священник": "sources/Темы/Священник.md",
      "Учёный": "sources/Темы/Учёный.md"
    }
  },
  "Черты": {
    "type": "card-list",
    "items": {
      "Черты": "sources/Черты/Черты.md"
    }
  },
  "Экзокортекс": "sources/Экзокортекс.md"
};

if (typeof module !== 'undefined' && module.exports) {
  module.exports = structure;
}

if (typeof window !== 'undefined') {
  window.structure = structure;
}