const structure = {
  Справочники: {
    type: "folder",
    items: {
      Классы: "Классы/index.md",
      Расы: "Расы/Расы CRB/index.md",
      Навыки: "Навыки.md",
      Черты: "Черты/index.md",
      Темы: "Создание персонажей/Темы.md",
      Снаряжение: "Снаряжение/index.md",
      Звездолёты: "Звездолёты.md",
      "Магия и заклинания": "Заклинания/index.md",
    },
  },

  // Можно добавить другие разделы, если нужно
  "Тактические правила": {
    type: "folder",
    items: {
      Бой: "Тактические правила/Бой.md",
      Состояния: "Тактические правила/Состояния.md",
      Передвижение: "Тактические правила/Передвижение.md",
    },
  },

  "Миры игры": {
    type: "folder",
    items: {
      Планеты: "Миры игры/Планеты.md",
      Фракции: "Миры игры/Фракции.md",
      Локации: "Миры игры/Локации.md",
    },
  },
};
