const structure = {
  Справочники: {
    type: "folder",
    items: {
      Классы: {
        type: "card-list",
        items: {
          Механик: "sources/Классы/Механик.md",
          Мистик: "Классы/Мистик.md",
          Солдат: "Классы/Солдат.md",
          Техномант: "Классы/Техномант.md",
          Оперативник: "Классы/Оператор.md",
          Посланник: "Классы/Посланник.md",
        },
      },
      Расы: "Расы/Расы CRB/Расы.md",
      Навыки: "Навыки.md",
      Черты: "Черты/index.md",
      Темы: "Создание персонажей/Темы.md",
      Снаряжение: "Снаряжение/Снаряжение.md",
      Звездолёты: "Звездолёты.md",
      "Магия и заклинания": "Заклинания/index.md",
    },
  },
  "Тактические правила": {
    type: "folder",
    items: {
      Бой: "Тактические правила/Бой.md",
      Состояния: "Тактические правила/Состояния.md",
      Передвижение: "Тактические правила/Передвижение.md",
    },
  },
  "Миры игры": {
    type: "folder",
    items: {
      Планеты: "Миры игры/Планеты.md",
      Фракции: "Миры игры/Фракции.md",
      Локации: "Миры игры/Локации.md",
    },
  },
};
